{ "_id" : { "$oid" : "52ca81a66c6f631807940000" }, "deskripsi" : "Terletak di bagian bawah monitor yang banyak terdapat kapasitor,dan berfungsi untuk menampung sumber daya listrik dari outlet AC Power Cord Switching Power Supply pada System Unit.", "gejala_ids" : [ { "$oid" : "52ca7e036c6f6318078c0000" }, { "$oid" : "52ca7e036c6f6318078d0000" }, { "$oid" : "52ca7e036c6f631807500000" } ], "nama" : "Power Supply monitor", "solusi" : "Periksa arus kabel power, jika kabel putus ganti dengan yang baru. \nPeriksa bagian fuse, dioda bridge, transistor output, Regulator, Dioda Zener, IC Oscilator.\nPeriksa bagian Elco Filter, Dioda Bridge\nPeriksa bagian Condensator dan Oscilator" }
{ "_id" : { "$oid" : "52ca81a66c6f631807950000" }, "deskripsi" : "berfungsi untuk membangkitkan tegangan tinggi untuk tabung dan menghasilkan tegangan dengan bentuk dan amplitudo tertentu yang akan disalurkan ke defleksi horizontal, sehingga akan mengatur jalannya gerakan berkas electron dari kiri ke kanan/scanning ke arah horizontal. ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f631807860000" }, { "$oid" : "52ca7e036c6f631807870000" }, { "$oid" : "52ca7e036c6f631807880000" }, { "$oid" : "52ca7e036c6f631807890000" }, { "$oid" : "52ca7e036c6f6318078a0000" }, { "$oid" : "52ca7e036c6f6318078b0000" }, { "$oid" : "52ca7e036c6f631807850000" }, { "$oid" : "52ca7e036c6f631807520000" } ], "nama" : "Horizontal monitor", "solusi" : "Periksa bagian IC Oscilator Horizontal, Transistor Driver Horizontal, Transistor Output Horizotal, Playback.\r\nPeriksa bagian Trimpot H-Hold, Trimpot H-Line, IC Oscilator Horizontal. \r\nPeriksa bagian Transistor Pelebar Jalur, Yoke Defleksi. Raster monitor satu garis vertikal Periksa bagian Condensator Non Polar, Yoke Defleksi. \r\nPeriksa bagian hold Card Adapter, IC Syncronisasi dan kabel data. \r\nPeriksa bagian Trimpot Sub-Brigtness, Trimpot Sub-Contras, Potensio Screen\r\nPeriksa bagian Potensio Fokus dan Socket CRT. \r\nPeriksa bagian Trimpot Sub-Brigtness, Trimpot Sub-Contras, Potensio Screen, CRT. \r\nAtur pada Trimpot Pinchusion dan Yoke Defleksi. Ada blanking/garis-garis putih di monitor Periksa bagian Potensio Screen dan Playback." }
{ "_id" : { "$oid" : "52ca81a66c6f631807960000" }, "deskripsi" : "Berfungsi untuk membangkitkan tegangan tinggi untuk tabung dan menghasilkan tegangan dengan bentuk dan amplitudo tertentu yang akan disalurkan ke defleksi vertikal, sehingga akan mengatur jalannya gerakan berkas elektron dari atas ke bawah/scanning ke arah vertikal.   ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f631807530000" }, { "$oid" : "52ca7e036c6f631807810000" }, { "$oid" : "52ca7e036c6f631807820000" }, { "$oid" : "52ca7e036c6f631807830000" }, { "$oid" : "52ca7e036c6f631807840000" } ], "nama" : "Vertikal monitor", "solusi" : "Periksa bagian Condensator Vertikal. \r\nPeriksa bagian Card Adapter, Kabel Data, IC Oscilator Vertikal, Trimpot V-Hold. \r\nPeriksa bagian IC Vertikal dan Trimpot V-Size. \r\nPeriksa bagian Trimpot V-Hold dan Trimpot V-Line. \r\nPeriksa bagian Trimpot V-Hold,Trimpot V-Line, Trimpot V- Size." }
{ "_id" : { "$oid" : "52ca81a66c6f631807970000" }, "deskripsi" : "Disebut juga sebagai rangkaian matrix. Adapun prinsip kerja rangkaian matrix adalah mengubah tegangan perbedaan warna yang telah dicampur dengan sinyal sinkronisasi yang diberikan demulator warna kembali menjadi tegangan perbedaan warna. ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f6318077f0000" }, { "$oid" : "52ca7e036c6f631807800000" }, { "$oid" : "52ca7e036c6f6318077e0000" }, { "$oid" : "52ca7e036c6f631807510000" } ], "nama" : "RGB monitor", "solusi" : "Periksa bagian Card Adapter, IC RGB, Trimpot RGB, Transistor RGB, CRT." }
{ "_id" : { "$oid" : "52ca81a66c6f631807980000" }, "deskripsi" : "Berada di dalam leher tabung kita kenal kumparan pembelok, yaitu kumparan untuk horisontal, dan kumparan untuk vertikal. Dalam kumparan untuk fokus pengaturan besar kecilnya arus diatur oleh sebuah potensiometer. Guna pembelokan ini ialah supaya gerak elektron yang semula menuju satu titik fokus yang harus disesuaikan dengan arah sejajar. ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f631807790000" }, { "$oid" : "52ca7e036c6f6318077a0000" }, { "$oid" : "52ca7e036c6f6318077b0000" }, { "$oid" : "52ca7e036c6f6318077d0000" }, { "$oid" : "52ca7e036c6f631807530000" }, { "$oid" : "52ca7e036c6f631807520000" } ], "nama" : "Yoke monitor", "solusi" : "Periksa bagian Yoke Defleksi.\r\nPosisi Yoke Defleksi kurang maju kedepan. \r\nPosisi Yoke Defleksi terlalu miring." }
{ "_id" : { "$oid" : "52ca81a66c6f631807990000" }, "deskripsi" : "Singkatan dari Catoda Ray Tube, yaitu tabung sinar katode (layar monitor) yang difokuskan sinar elektron sehingga membentuk pola gambar berwarna dan dipakai sebagai layar pada video player, televisi, dan sejenisnya. ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f631807740000" }, { "$oid" : "52ca7e036c6f631807750000" }, { "$oid" : "52ca7e036c6f631807760000" }, { "$oid" : "52ca7e036c6f631807770000" }, { "$oid" : "52ca7e036c6f631807780000" }, { "$oid" : "52ca7e036c6f631807520000" } ], "nama" : "CRT monitor", "solusi" : "Periksa bagian CRT,IC Oscilator Horizontal, Transistor Driver Horizontal, Transistor Output Horizotal, Playback,naikkan tegangan filamen. \r\nHilangkan dengan magnet degausing." }
{ "_id" : { "$oid" : "52ca81a66c6f6318079a0000" }, "deskripsi" : "Berfungsi untuk memasok daya ke komponen lain pada PC. Semua komponen PC (selain power supply) akan memperoleh pasokan daya dari power supply tersebut.  ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f631807560000" }, { "$oid" : "52ca7e026c6f6318074b0000" }, { "$oid" : "52ca7e036c6f6318074d0000" } ], "nama" : "Power Supply CPU", "solusi" : "Periksa apakah kabel power sudah terpasang dengan benar. Jika kipas rusak ganti kipas power supply dengan yang baru. \r\nPeriksa arus listrik pada kabel power. Supply listrik kurang memadai, ganti power supply dengan daya yang lebih besar." }
{ "_id" : { "$oid" : "52ca81a66c6f6318079b0000" }, "deskripsi" : "Disebut juga papan induk, merupakan pusat pengendali yang mengatur kerja dari semua komponen yang terpasang padanya.  ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f631807540000" }, { "$oid" : "52ca7e036c6f6318075f0000" }, { "$oid" : "52ca7e036c6f631807600000" }, { "$oid" : "52ca7e026c6f6318074c0000" } ], "nama" : "Motherboard", "solusi" : "Batere CMOS sudah habis, segera ganti dengan yang baru. \r\nCek suhu pada motherboard, apabila terlalu panas tambahkan kipas tambahan. Bersihkan motherboard dari debu. \r\nInstall driver USB yang sesuai dengan jenisnya. USB port kemungkinan rusak, ganti dengan USB port card pada slot ekspansi." }
{ "_id" : { "$oid" : "52ca81a66c6f6318079c0000" }, "deskripsi" : "Dikenal juga dengan Central Processing Unit, merupakan pusat pengeksekusi setiap tugas atau perintah baik yang berupa data maupun informasi di dalam sistem komputer. ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f631807550000" }, { "$oid" : "52ca7e036c6f631807670000" }, { "$oid" : "52ca7e026c6f6318074c0000" }, { "$oid" : "52ca7e036c6f6318074e0000" }, { "$oid" : "52ca7e036c6f6318074d0000" } ], "nama" : "Processor", "solusi" : "Periksa apakah suhu processor tinggi, bersihkan kipas dari debu atau ganti kipas processor dengan yang lebih baik. \r\nCek apakah processor sudah terpasang dengan benar. Cek setting motherboard, apakah jumper-jumper sudah terpasang dengan benar. \r\nPeriksa apakah suhu processor tinggi, bersihkan kipas dari debu atau ganti kipas processor dengan yang lebih baik. \r\nBersihkan kipas dari debu yang menghambat perputaran kipas. Periksa apakah fan motor rusak, ganti dengan yang baru." }
{ "_id" : { "$oid" : "52ca81a66c6f6318079d0000" }, "deskripsi" : "Merupakan perangkat keras yang digunakan untuk menyimpan data secara permanen menurut perintah-perintah yang diberikan oleh pusat pemrosesan komputer.  ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f631807690000" }, { "$oid" : "52ca7e036c6f631807720000" }, { "$oid" : "52ca7e036c6f631807730000" }, { "$oid" : "52ca7e036c6f631807570000" }, { "$oid" : "52ca7e036c6f631807610000" }, { "$oid" : "52ca7e036c6f631807620000" }, { "$oid" : "52ca7e036c6f6318074e0000" }, { "$oid" : "52ca7e026c6f6318074c0000" } ], "nama" : "Hardisk ", "solusi" : "Periksa bagian head optic, mungkin sudah mengalami kerusakan. Kemungkinan harddisk terjadi badsector pada bagian platter, jika masih memungkinkan gunakan disk manager untuk memformat. \r\nPeriksa kabel power harddisk, kabel data harddisk, jumper harddisk apakah sudah terpasang dengan benar. \r\nKemungkinan harddisk terjadi badsector pada bagian platter, jika masih memungkinkan gunakan disk manager untuk memformat. \r\nKomputer sering di matikan dengan tidak benar, format harddisk dengan disk manager yang sesuai harddisk. \r\nPemasangan jumper harddisk tidak benar, periksa & perbaiki kembali setting jumper I/O harddisk. \r\nKemungkinan harddisk terdapat badsector pada bagian tertentu, jika masih memungkinkan gunakan disk manager untuk memformat. \r\nHarddisk belum diformat, format harddisk menggunakan disket fdisk. \r\nPeriksa kabel power apakah sudah terpasang dengan benar. Kemungkinan terdapat bad sector jika masih memungkinkan gunakan disk manager untuk memformat." }
{ "_id" : { "$oid" : "52ca81a66c6f6318079e0000" }, "deskripsi" : "singkatan dari Video Graphics Adapter, adalah standar tampilan komputer analog yang dipasarkan pertama kali oleh IBM pada tahun 1987. Tugas VGA adalah menghasilkan tampilan secara visual dari komputer. ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f631807580000" }, { "$oid" : "52ca7e036c6f631807630000" }, { "$oid" : "52ca7e036c6f631807700000" }, { "$oid" : "52ca7e036c6f631807710000" }, { "$oid" : "52ca7e036c6f631807520000" }, { "$oid" : "52ca7e026c6f6318074c0000" } ], "nama" : "VGA", "solusi" : "Periksa arus kabel dari VGA ke monitor.\r\nPeriksa apakah VGA sudah terpasang dengan benar.\r\nKemungkinan pemasangan VGA tidak benar. Suhu VGA card terlalu panas, gunakan kipas tambahan. \r\nInstall driver VGA yang sesuai dengan jenis VGA. \r\nInstall driver VGA yang sesuai dengan jenis VGA. \r\nTerjadi kerusakan di modul memory video, ganti VGA dengan yang baru. \r\nPeriksa apakah VGA terpasang dengan benar, apabila masih terjadi masalah kemungkinan VGA sudah rusak, ganti dengan yang baru. \r\nInstall ulang driver VGA dengan yang lebih baru." }
{ "_id" : { "$oid" : "52ca81a66c6f6318079f0000" }, "deskripsi" : "RAM singkatan dari Random Access Memory, termasuk kelompok memory utama dalam komputer dimana RAM merupakan tempat penyimpanan semua data yang dimasukkan oleh komponen input. ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f6318075a0000" }, { "$oid" : "52ca7e036c6f631807640000" }, { "$oid" : "52ca7e026c6f6318074b0000" }, { "$oid" : "52ca7e036c6f6318074e0000" }, { "$oid" : "52ca7e026c6f6318074c0000" } ], "nama" : "Memory (RAM)", "solusi" : "Periksa apakah memory sudah terpasang dengan benar. \r\nKemungkinan terjadi konflik antar card, lepas momory dan pasang kembali. Kapasitas memory sudah maksimal, tambahkan kapasitas memory. Memory yang digunakan tidak cocok, ganti dengan merk yang lain. \r\nSuhu memory terlalu panas, tambahkan kipas tambahan. \r\nTerjadi kerusakan di modul memory RAM, ganti RAM dengan yang baru. Memory tidak dikenali Memory yang digunakan tidak cocok, ganti dengan merk yang lain. \r\nPemasangan memory tidak tepat, lepaskan memory dan pasang kembali." }
{ "_id" : { "$oid" : "52ca81a66c6f631807a00000" }, "deskripsi" : "CD/DVD Room adalah sebuah piringan kompak dari jenis piringan optik (optical disc) yang dapat menyimpan data. ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f6318075b0000" }, { "$oid" : "52ca7e036c6f6318075c0000" }, { "$oid" : "52ca7e036c6f631807650000" }, { "$oid" : "52ca7e036c6f6318076e0000" }, { "$oid" : "52ca7e036c6f6318076f0000" }, { "$oid" : "52ca7e036c6f6318074e0000" } ], "nama" : "CD/DVD Room", "solusi" : "Periksa kabel power, kabel data dan setting jumper CD Room apakah sudah terpasang dengan benar. \r\nPeriksa kabel power CD Room apakah sudah terpasang dengan benar. \r\nKemungkinan optic kotor, bersihkan optic dari debu. Kemungkinan terjadi kerusakan pada optik, jika masih memungkinkan, perbaiki dengan cara men-set ulang optik tersebut. \r\nKepingan CD sudah rusak atau kotor, jika masih memingkinkan bersihkan dengan cairan pembersih. \r\nKemungkinan terjadi kerusakan pada mekanik motor atau karet motor, ganti komponen dengan yang baru. \r\nKemungkinan terjadi kerusakan pada motor penggerak CD, ganti komponen dengan yang baru." }
{ "_id" : { "$oid" : "52ca81a66c6f631807a10000" }, "deskripsi" : "Sound Card adalah suatu perangkat keras komputer yang digunakan untuk mengeluarkan suara dan merekam suara ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f6318075d0000" }, { "$oid" : "52ca7e036c6f631807660000" }, { "$oid" : "52ca7e026c6f6318074c0000" } ], "nama" : "Sound Card", "solusi" : "Periksa apakah sound card sudah terpasang dengan benar. \r\nInstall driver sound card yang sesuai. Chip sound card on board belum dimatikan, matikan lewat BIOS atau setting jumper. \r\nInstall driver sound card yang sesuai dengan jenisnya." }
{ "_id" : { "$oid" : "52ca81a66c6f631807a20000" }, "deskripsi" : "Merupakan salah satu jenis komponen input Pointing device, yaitu alat penerima input yang berasal dari getaran suatu benda. Alat tersebut dihubungkan dengan komputer dan jika digerakkan maka akan memberikan sinyal tertentu pada komputer sehingga bisa digunakan untuk memberikan instruksi yang diinginkan pemakai. ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f6318076d0000" }, { "$oid" : "52ca7e036c6f631807670000" } ], "nama" : "Mouse Optic/bola", "solusi" : "Periksa apakah kabel mouse sudah terpasang dengan benar. Install ulang driver mouse. Kemungkinan mouse rusak, ganti dengan yang baru. \r\nKemungkinan konektor mouse renggang, segera pasang dengan benar. " }
{ "_id" : { "$oid" : "52ca81a66c6f631807a30000" }, "deskripsi" : "Operating sistem adalah Sebuah aplikasi yang di install di dalam komputer dan digunakan untuk mejalankan aplikasi lain  ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f631807920000" }, { "$oid" : "52ca7e036c6f631807930000" } ], "nama" : " Operating System failure", "solusi" : "  Install ulang Operating System anda!!!!!  " }
{ "_id" : { "$oid" : "52ca81a66c6f631807a40000" }, "deskripsi" : "Merupakan media penyimpanan eksternal yang bisa dicabut dan dipasang kapan saja kita inginkan.  ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f6318076a0000" }, { "$oid" : "52ca7e036c6f6318076b0000" }, { "$oid" : "52ca7e036c6f6318076c0000" }, { "$oid" : "52ca7e036c6f6318075e0000" }, { "$oid" : "52ca7e026c6f6318074c0000" } ], "nama" : "Floppy Disk (FDD)", "solusi" : "Kemungkinan disket yang dipakai sudah rusak, sehingga tidak dapat dibaca FDD. Periksa tegangan kabel Power, controller, konektor dan terminal. \r\nPeriksa konektor kabel power apakah sudah benar atau tidak. Motor FDD tidak berputar Periksa tegangan kabel Power, controller, konektor dan terminal. Periksa motor, jika sudah rusak ganti motor dengan yang baru. \r\nberputar Spindel error, cek cengkraman pada spindel. \r\nPeriksa tegangan konektor dan PS. Periksa mekanik head, biasanya tekanan head. Head kotor, bersihkan head dari debu/kotoran. Disket tidak dapat diformat Periksa proteksi pada disket, buka proteksinya jika diproteksi. \r\nPeriksa kabel power apakah sudah terpasang dengan benar." }
{ "_id" : { "$oid" : "52ca81a66c6f631807a50000" }, "deskripsi" : "Disebut juga papan ketik merupakan sarana untuk memasukkan data yang berupa teks, selain itu keyboard juga digunakan untuk memberikan parintah atau instruksipada komputer dengan cara menekan tombol-tombol yang telah disediakan.  ", "gejala_ids" : [ { "$oid" : "52ca7e036c6f631807680000" }, { "$oid" : "52ca7e036c6f6318078f0000" }, { "$oid" : "52ca7e036c6f631807900000" } ], "nama" : "Keyboard", "solusi" : "Matikan komputer, cabut keybord dan tancapkan kembali lalu nyalakan komputer. Jika belum bisa berarti keyboard rusak, ganti dengan yang baru. \r\nKemungkinan keyboard berdebu, bersihkan tombol-tombol keybord dari debu." }
{ "_id" : { "$oid" : "52d6c9896c6f631d16000000" } }
{ "_id" : { "$oid" : "52d7700a6c6f63167a000000" }, "gejala_ids" : [], "nama" : "coba" }
